Revit 2024 API
BoundarySegment.LinkElementId Property
 Retrieve the element id of the element in a link instance that forms this boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId LinkElementId { get; }
Visual Basic
Public ReadOnly Property LinkElementId As ElementId
	Get
Visual C++
public:
property ElementId^ LinkElementId {
	ElementId^ get ();
}
See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace